; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v1 ?v8)
             (pred_3 ?v12 ?v11)
             (pred_11 ?v1 ?v11)
             (pred_4 ?v5 ?v1 )
	     (pred_7 ?v1)
             (pred_12 ?v2)
             (pred_10 ?v12)
             (pred_6 ?v11)
             (pred_5 ?v1)
             (pred_1 ?v12)
             (pred_9 ?v1)
             (pred_2 ))



(:action op_2
:parameters (?v3 ?v7 ?v4 ?v13)
:precondition (and (pred_12 ?v3) (pred_12 ?v7) (pred_10 ?v4) (pred_6 ?v13)
          (pred_8 ?v3 ?v7) (pred_3 ?v4 ?v13)
                   (pred_11 ?v7 ?v13) (pred_7 ?v3) 
                   (pred_5 ?v7) (pred_1 ?v4))
:effect (and  (pred_9 ?v7) (not (pred_5 ?v7))))


(:action op_5
:parameters (?v3 ?v9)
:precondition (and (pred_12 ?v3) (pred_12 ?v9)
               (pred_7 ?v3) (pred_8 ?v3 ?v9) (pred_9 ?v9))
:effect (and (pred_7 ?v9) (not (pred_7 ?v3))))

(:action op_4
:parameters (?v3 ?v4)
:precondition (and (pred_12 ?v3) (pred_10 ?v4) 
                  (pred_7 ?v3) (pred_4 ?v4 ?v3) (pred_2 ))
:effect (and (pred_1 ?v4)
   (not (pred_4 ?v4 ?v3)) (not (pred_2 ))))


(:action op_3
:parameters (?v3 ?v6 ?v10)
:precondition (and (pred_12 ?v3) (pred_10 ?v6) (pred_10 ?v10)
                  (pred_7 ?v3) (pred_1 ?v10) (pred_4 ?v6 ?v3))
:effect (and (pred_1 ?v6) (pred_4 ?v10 ?v3)
        (not (pred_1 ?v10)) (not (pred_4 ?v6 ?v3))))

(:action op_1
:parameters (?v3 ?v4)
:precondition (and (pred_12 ?v3) (pred_10 ?v4) 
                  (pred_7 ?v3) (pred_1 ?v4))
:effect (and (pred_2 ) (pred_4 ?v4 ?v3) (not (pred_1 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_20 obj_02 obj_11 obj_07 obj_16 obj_06 obj_15 obj_13 obj_18 obj_19 obj_09 obj_05 obj_12 obj_10 obj_03
    obj_08 obj_01
    obj_04 obj_17 obj_14
    )

    (:init
       (pred_2)

       (pred_12 obj_21)
       (pred_12 obj_20)
       (pred_12 obj_02)
       (pred_12 obj_11)
       (pred_12 obj_07)
       (pred_12 obj_16)
       (pred_12 obj_06)
       (pred_12 obj_15)
       (pred_12 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_19)
       (pred_12 obj_09)
       (pred_12 obj_05)
       (pred_12 obj_12)
       (pred_12 obj_10)
       (pred_12 obj_03)
       (pred_6 obj_08)
       (pred_6 obj_01)
       (pred_10 obj_04)
       (pred_10 obj_17)
       (pred_10 obj_14)

       (pred_8 obj_21 obj_07)
       (pred_8 obj_21 obj_20)
       (pred_8 obj_20 obj_16)
       (pred_8 obj_20 obj_02)
       (pred_8 obj_20 obj_21)
       (pred_8 obj_02 obj_06)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_02 obj_20)
       (pred_8 obj_11 obj_15)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_07 obj_13)
       (pred_8 obj_07 obj_16)
       (pred_8 obj_07 obj_21)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_16 obj_06)
       (pred_8 obj_16 obj_20)
       (pred_8 obj_16 obj_07)
       (pred_8 obj_06 obj_19)
       (pred_8 obj_06 obj_15)
       (pred_8 obj_06 obj_02)
       (pred_8 obj_06 obj_16)
       (pred_8 obj_15 obj_09)
       (pred_8 obj_15 obj_11)
       (pred_8 obj_15 obj_06)
       (pred_8 obj_13 obj_05)
       (pred_8 obj_13 obj_18)
       (pred_8 obj_13 obj_07)
       (pred_8 obj_18 obj_12)
       (pred_8 obj_18 obj_19)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_18 obj_13)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_19 obj_09)
       (pred_8 obj_19 obj_06)
       (pred_8 obj_19 obj_18)
       (pred_8 obj_09 obj_03)
       (pred_8 obj_09 obj_15)
       (pred_8 obj_09 obj_19)
       (pred_8 obj_05 obj_12)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_12 obj_18)
       (pred_8 obj_12 obj_05)
       (pred_8 obj_10 obj_03)
       (pred_8 obj_10 obj_19)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_03 obj_09)
       (pred_8 obj_03 obj_10)
       (pred_5 obj_21)
       (pred_5 obj_07)
       (pred_5 obj_16)
       (pred_11  obj_21 obj_08)
       (pred_11  obj_07 obj_01)
       (pred_11  obj_16 obj_08)
       (pred_9 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_11)
       (pred_9 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_13)
       (pred_9 obj_18)
       (pred_9 obj_19)
       (pred_9 obj_09)
       (pred_9 obj_05)
       (pred_9 obj_12)
       (pred_9 obj_10)
       (pred_9 obj_03)

       (pred_3  obj_04 obj_08)
       (pred_3  obj_17 obj_01)
       (pred_3  obj_14 obj_01)
       (pred_4 obj_04 obj_11)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_14 obj_20)
       (pred_7 obj_18)
    )

    (:goal (and
       (pred_4 obj_04 obj_12)
       (pred_4 obj_14 obj_18)
    ))
(:constraints
  (always (not (pred_7 obj_16)))
)
)

; plan
1. (op_5 obj_18 obj_19)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_19)
   goals met: 0 of 2
2. (op_5 obj_19 obj_06)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_06)
   goals met: 0 of 2
3. (op_5 obj_06 obj_02)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_02)
   goals met: 0 of 2
4. (op_5 obj_02 obj_11)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_11)
   goals met: 0 of 2
5. (op_4 obj_11 obj_04)
   deleted: (pred_4 obj_04 obj_11) (pred_2)
   added: (pred_1 obj_04)
   goals met: 0 of 2
6. (op_5 obj_11 obj_02)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_02)
   goals met: 0 of 2
7. (op_1 obj_02 obj_04)
   deleted: (pred_1 obj_04)
   added: (pred_2) (pred_4 obj_04 obj_02)
   goals met: 0 of 2
8. (op_5 obj_02 obj_20)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_20)
   goals met: 0 of 2
9. (op_4 obj_20 obj_14)
   deleted: (pred_4 obj_14 obj_20) (pred_2)
   added: (pred_1 obj_14)
   goals met: 0 of 2
10. (op_5 obj_20 obj_02)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_02)
   goals met: 0 of 2
11. (op_5 obj_02 obj_06)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_06)
   goals met: 0 of 2
12. (op_1 obj_06 obj_14)
   deleted: (pred_1 obj_14)
   added: (pred_2) (pred_4 obj_14 obj_06)
   goals met: 0 of 2
13. (op_5 obj_06 obj_02)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_02)
   goals met: 0 of 2
14. (op_4 obj_02 obj_04)
   deleted: (pred_4 obj_04 obj_02) (pred_2)
   added: (pred_1 obj_04)
   goals met: 0 of 2
15. (op_5 obj_02 obj_06)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_06)
   goals met: 0 of 2
16. (op_5 obj_06 obj_19)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_19)
   goals met: 0 of 2
17. (op_1 obj_19 obj_04)
   deleted: (pred_1 obj_04)
   added: (pred_2) (pred_4 obj_04 obj_19)
   goals met: 0 of 2
18. (op_5 obj_19 obj_06)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_06)
   goals met: 0 of 2
19. (op_4 obj_06 obj_14)
   deleted: (pred_4 obj_14 obj_06) (pred_2)
   added: (pred_1 obj_14)
   goals met: 0 of 2
20. (op_5 obj_06 obj_19)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_19)
   goals met: 0 of 2
21. (op_5 obj_19 obj_18)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_18)
   goals met: 0 of 2
22. (op_1 obj_18 obj_14)
   deleted: (pred_1 obj_14)
   added: (pred_2) (pred_4 obj_14 obj_18)
   goals met: 1 of 2
23. (op_5 obj_18 obj_19)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_19)
   goals met: 1 of 2
24. (op_4 obj_19 obj_04)
   deleted: (pred_4 obj_04 obj_19) (pred_2)
   added: (pred_1 obj_04)
   goals met: 1 of 2
25. (op_5 obj_19 obj_18)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_18)
   goals met: 1 of 2
26. (op_5 obj_18 obj_12)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_12)
   goals met: 1 of 2
27. (op_1 obj_12 obj_04)
   deleted: (pred_1 obj_04)
   added: (pred_2) (pred_4 obj_04 obj_12)
   goals met: 2 of 2
